// Ps1 Call
$ret = $Global:PIDGENX::GetPKeyData(
  $key, $configPath, $Mpc, [IntPtr]::Zero, $HWID,
  [ref]$IID, [ref]$Edition, [ref]$Channel, [ref]$Partnum,
  [IntPtr]::Zero
)

>>>> >>>> >>>> >>>> >>>> >>>> >>>> >>>> >>>> >>>> 

 // GetPKeyData
 v23 = *(__int64 (__fastcall **)(__int64, _QWORD, wchar_t *, _QWORD, _DWORD, __int64 *))(*(_QWORD *)v50 + 64i64);
 _guard_check_icall_fptr(v23);
 v18 = v23(v22, 0i64, Str, 0i64, 0, &v48);
 v17 = v18;
 if ( v18 < 0 )
  goto LABEL_33;
 if ( *(_DWORD *)(*(_QWORD *)(v48 + 120) + 48i64) )
 {
  v24 = *(_QWORD *)(v48 + 128);
  v25 = *(_DWORD *)(v24 + 48);
  v26 = (unsigned int)(*(_QWORD *)(v48 + 144) / 0x3E8ui64) % (*(_DWORD *)(v24 + 52) - v25 + 1);
  *(_DWORD *)(v48 + 24) = v25 + v26;
  *(_DWORD *)(v48 + 64) = (v25 + v26) % 0xF4240;
  *(_DWORD *)(v48 + 60) = *(_DWORD *)(v48 + 24) / 0xF4240u;
 }
 ProcessHeap = GetProcessHeap();
 v12 = HeapAlloc(ProcessHeap, 0, 0x58ui64);
 if ( !v12 )
  goto LABEL_2;
 v28 = v48;
 *v12 = *(_OWORD *)(v48 + 32);
 v12[1] = *(_OWORD *)(v28 + 48);
 v12[2] = *(_OWORD *)(v28 + 64);
 v12[3] = *(_OWORD *)(v28 + 80);
 v12[4] = *(_OWORD *)(v28 + 96);
 *((_QWORD *)v12 + 10) = *(_QWORD *)(v28 + 112);
 v18 = sub_180001E80(*(_QWORD *)(*(_QWORD *)(v48 + 120) + 24i64), &v53);
 v17 = v18;
 if ( v18 < 0 )
  goto LABEL_33;
 v29 = sub_180001E80(*(_QWORD *)(*(_QWORD *)(v48 + 120) + 40i64), &lpMem);
 v17 = v29;
 if ( v29 < 0 )
 {
  sub_180002E08((unsigned int)v29);
  v14 = lpMem;

      {
        v8 = -2147467259;
      }
      sub_180002E08((unsigned int)v8);
      sub_180005B00(&unk_1800D5D9D, &unk_180101F50);
    }
  }
  else
  {
    v8 = -2147418113;
    sub_180005B00(&unk_1800D577C, &unk_180101F18);
    sub_180002E08(2147549183i64);
    sub_180006810(&unk_1800E723C, &unk_18010208C);
  }
  sub_180002E28((unsigned int)v8);
  if ( v8 < 0 )
  {
    sub_180006810(&unk_1800F0093, &unk_180101AE4);
    goto LABEL_5;
  }
  v16 = FileTime;
  
  *(_OWORD *)(a1 + 32) = *(_OWORD *)a2;
  *(_OWORD *)(a1 + 48) = *(_OWORD *)(a2 + 16);
  *(_OWORD *)(a1 + 64) = *(_OWORD *)(a2 + 32);
  *(_OWORD *)(a1 + 80) = *(_OWORD *)(a2 + 48);
  *(_OWORD *)(a1 + 96) = *(_OWORD *)(a2 + 64);
  *(_QWORD *)(a1 + 112) = *(_QWORD *)(a2 + 80);
  *(struct _FILETIME *)(a1 + 16) = v16;
  sub_1800064C4(&unk_1800DE881, &unk_180102218);
  *(_DWORD *)(a1 + 24) = *(_DWORD *)(a2 + 32) + 1000000 * *(_DWORD *)(a2 + 28);
  sub_180006EAC(&unk_1800FCFFC, &unk_180101B28);
  v17 = v34;
  sub_180005120(&unk_1800CFD92, &unk_180101B7C);
  v34 = 0i64;
  v18 = *(_QWORD *)(a1 + 8);
  sub_180005E44(&unk_1800E809C, &unk_180102178);
  if ( v18 )
  {
    ProcessHeap = GetProcessHeap();
    HeapFree(ProcessHeap, 0, (LPVOID)(v18 - 4));
    sub_180002E28(0i64);
  }
  v20 = 0i64;
  if ( v17 )
    v20 = v17;
  v37 = 0i64;
  *(_QWORD *)(a1 + 8) = v20;
  sub_180006810(&unk_1800DEFF1, &unk_180101A2C);
  v21 = *(void **)(a1 + 120);
  if ( v21 )
    sub_180002CB0(v21);
  *(_QWORD *)(a1 + 120) = a3;
  sub_1800057B4(&unk_1800EC498, &unk_180101820);
  v22 = *(void **)(a1 + 128);
  v36 = 0i64;
  if ( v22 )
    sub_180002C18(v22);
  *(_QWORD *)(a1 + 128) = v39;
  sub_180006190(&unk_1800E01F0, &unk_180101B10);
  v23 = *(void **)(a1 + 136);
  lpMem = 0i64;
  sub_180005470(&unk_1800E2047, &unk_180101C94);
  if ( v23 )
    sub_180002B5C(v23);
  *(_QWORD *)(a1 + 136) = a5;
LABEL_40:
  sub_180002E28((unsigned int)v8);
  v24 = StringUuid;
  if ( StringUuid )
  {
    sub_180006B60(&unk_1800EF65D, &unk_180101A70);
    String = v24;
    sub_180005470(&unk_1800F1E40, &unk_180101C80);
    RpcStringFreeW(&String);
    StringUuid = 0i64;
  }
  if ( v33 )
  {
    v25 = (void *)(v33 - 4);
    v26 = GetProcessHeap();
    HeapFree(v26, 0, v25);
    sub_180002E28(0i64);
  }
  if ( v34 )
  {
    v27 = (void *)(v34 - 4);
    v28 = GetProcessHeap();
    HeapFree(v28, 0, v27);
    sub_180002E28(0i64);
  }
  if ( lpMem )
  {
    sub_180002B5C(lpMem);
    sub_180006190(&unk_1800F1E70, &unk_180101C84);
  }
  v29 = v36;
  if ( v36 )
  {
    sub_180006EAC(&unk_1800DD02B, &unk_180102200);
    sub_180002C18(v29);
  }
  v30 = v37;
  if ( v37 )
  {
    sub_1800057B4(&unk_1800EFAAD, &unk_180101AB4);
    sub_180002CB0(v30);
  }
  return (unsigned int)v8;
}

>>>> >>>> >>>> >>>> >>>> >>>> >>>> >>>> >>>> >>>> 

// v16 = v15(a3, v65);
// in Unprotected file ... 

// {v12} Psudo Struct
// Size: 0x58 (88 bytes) // v12
typedef struct _MSFT_PKEY_DATA {
	uint64_t Header;            // 0x00
	GUID     Algorithm;         // 0x08
	uint32_t GroupID;           // 0x18
	uint32_t ChannelID;         // 0x1C
	uint32_t Serial;            // 0x20
	uint32_t Sequence;          // 0x24
	uint64_t SecurityID;        // 0x28
	uint32_t LicenseAttributes; // 0x30
	uint32_t KeyType;           // 0x34
	uint64_t IssuanceTimestamp; // 0x38
	uint32_t ActivationFlags;   // 0x40
	uint32_t ReservedPadding;   // 0x44
	uint8_t  HardwareID[16];    // 0x48
} MSFT_PKEY_DATA;

Full Context Hex Dump:
0000: 00 00 00 00 00 00 00 00 EF 72 06 66 09 78 FD 4C
0010: 8D 54 41 B7 FB 73 89 88 0D 11 00 00 00 00 00 00
0020: 00 00 00 00 00 00 00 00 2C E0 B4 EA CD 1F 00 00
0030: 01 00 00 00 01 00 00 00 0D 11 00 00 00 00 B0 80
0040: D3 AA 37 7F 80 23 09 00 00 00 00 80 86 08 60 01
0050: A7 55 6F FE 00 00 00 00 00 00 00 00 00 00 00 00

__int64 __fastcall sub_1800090B0(__int64 a1, __int64 a2)
{
  __int64 v4; // r8
  unsigned int v5; // ebx
  __int64 v6; // rcx
  int v7; // eax
  int v8; // eax
  __int128 v9; // xmm1
  __int128 v10; // xmm0
  __int128 v11; // xmm1
  __int128 v12; // xmm0
  __int128 v14; // [rsp+28h] [rbp-29h] BYREF
  __int128 v15; // [rsp+38h] [rbp-19h]
  __int128 v16[6]; // [rsp+48h] [rbp-9h] BYREF
  int v17; // [rsp+C0h] [rbp+6Fh] BYREF

  v17 = 0;
  v14 = 0i64;
  v15 = 0i64;
  memset(v16, 0, 0x58ui64);
  v5 = 0;
  *((_QWORD *)&v16[2] + 1) = 0i64;
