function Get-PKeyData {
    param (
        [string]$key,
        [string]$configPath,
        [switch]$AsObject
    )

    $HWID       = 0L
    $MPC        = [IntPtr]::Zero
    $IID        = ""
    $Edition    = ""
    $Channel    = ""
    $Partnum    = ""

    # for the right way to calculate IID
    # use SLGenerateOfflineInstallationIdEx
    # cause we dont know the hwid value

    # to receive the confirmation ID ........
    # you will have to have the extended product id too.
    #Call-WebService -requestType 1 -installationId $ppwszInstallation -extendedProductId $extPid

    $results = @()

    try {
        # Validate input
        if ([string]::IsNullOrWhiteSpace($key) -or [string]::IsNullOrWhiteSpace($configPath)) {
            throw "KEY and CONFIG PATH cannot be empty."
        }
            
        try {
            
            $ret = $Global:PIDGENX::GetPKeyData(
                $key, $configPath, $Mpc, [IntPtr]::Zero, $HWID,
                [ref]$IID, [ref]$Edition, [ref]$Channel, [ref]$Partnum,
                [IntPtr]::Zero
            )

        } catch {
                
			<#
            >>> .InnerException Class <<<
            -----------------------------

            ErrorCode      : -1979645951
            Message        : Exception from HRESULT: 0x8A010001
            Data           : {}
            InnerException : 

Property                       Edition                                                                                                                                         
Value                          OEM:NONSLP                                                                                                                                      
Property                       Channel                                                                                                                                         
Value                          [Vb]X21-99682                                                                                                                                   
Property                       Partnum                                                                                                                                         
Value                          425068091656465646046967647235135916414204848077385098147320802                                                                                 
Property                       IID                                                                                                                                             
// >>>>>>>>>>
__int64 __fastcall sub_180006A94(
    __int64 a1,      // [In]  Pointer to Internal Data
    __int64 a2,      // [In]  Unused/Reserved (usually 0 or v23)
    __int64 a3,      // [In]  Hardware ID (HWID) or Seed
    __int64 a4,      // [In]  Reserved/Flags
    HLOCAL *a5       // [Out] Pointer to the generated IID string buffer
);
// >>>>>>>>>>
__int64 __fastcall GetPKeyData(.. .. .. .. ..) {
// ..........
v50 = 0i64;
v16 = sub_18000D160(v51, 0i64, Str, 0i64, 0, &lpMem); --> { return sub_180009A24(a1 + 16, a2, a3, a4, a5, a6); }
// ..........
if ( *(_DWORD *)(*((_QWORD *)lpMem + 15) + 48i64) )
{
  18 = *((_QWORD *)lpMem + 16);
  v19 = *(_DWORD *)(v18 + 48);
  v20 = (unsigned int)(*((_QWORD *)lpMem + 18) / 0x3E8ui64) % (*(_DWORD *)(v18 + 52) - v19 + 1);
  *((_DWORD *)lpMem + 6) = v19 + v20;
  *((_DWORD *)lpMem + 16) = (v19 + v20) % 0xF4240;
  *((_DWORD *)lpMem + 15) = *((_DWORD *)lpMem + 6) / 0xF4240u;
}
ProcessHeap = GetProcessHeap();
v12 = HeapAlloc(ProcessHeap, 0, 0x58ui64);
if ( !v12 )
  goto LABEL_2;
v22 = lpMem;
*v12 = *((_OWORD *)lpMem + 2);
v12[1] = v22[3];
v12[2] = v22[4];
v12[3] = v22[5];
v12[4] = v22[6];
*((_QWORD *)v12 + 10) = *((_QWORD *)v22 + 14);
// ..........
v23 = sub_180006A94((__int64)v12 + 8, a2, a5, a4, &v50);
// end of function 
}
// >>>>>>>>>>>
[+] PID Decoder Success
---------------------------
Group ID : 4365
Serial   : 99
Security : 120
---------------------------

MSFT_PKEY_DATA Context Hex Dump:
0000: 00 00 00 00 00 00 00 00 EF 72 06 66 09 78 FD 4C
0010: 8D 54 41 B7 FB 73 89 88 0D 11 00 00 00 00 00 00
0020: 63 00 00 00 00 00 00 00 78 00 00 00 00 00 00 00
0030: 01 00 00 00 01 00 00 00 0D 11 30 06 00 00 E0 01
0040: 00 00 00 00 00 83 09 00 C6 00 00 80 86 08 C0 03
0050: 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00

// Size: 0x58 (88 bytes) // v12
typedef struct _MSFT_PKEY_DATA {
	uint64_t Header;            // 0x00
	GUID     Algorithm;         // 0x08
	uint32_t GroupID;           // 0x18
	uint32_t ChannelID;         // 0x1C
	uint32_t Serial;            // 0x20
	uint32_t Sequence;          // 0x24
	uint64_t SecurityID;        // 0x28
	uint32_t LicenseAttributes; // 0x30
	uint32_t KeyType;           // 0x34
	uint64_t IssuanceTimestamp; // 0x38
	uint32_t ActivationFlags;   // 0x40
	uint32_t ReservedPadding;   // 0x44
	uint8_t  HardwareID[16];    // 0x48
} MSFT_PKEY_DATA;

// Size: 0x98 (152 bytes) // lpMem
typedef struct _PID_OBJ {
    uint64_t       RefCount;          // 0x00
    wchar_t*       ProductIdStr;      // 0x08
    FILETIME       ValidationTime;    // 0x10
    uint32_t       DataIdSequence;    // 0x18
    uint32_t       AlignmentPadding;  // 0x1C
    MSFT_PKEY_DATA Data;              // 0x20 - 0x78
    void*          pPKeyConfig;       // 0x78
    void*          pKeyBits;          // 0x80
    void*          pMetadata;         // 0x88
    uint8_t        RandomSeed[8];     // 0x90
} PID_OBJ;
// >>>>>>>>>>>
/**
 * @param a1 [In]  - Context: Session state and memory vtable (v51 + 0x10).
 * @param a2 [In]  - KeyStr: 25-character Product Key string.
 * @param a3 [In]  - CfgPath: Path to pkeyconfig.xrm-ms (XML license definitions).
 * @param a4 [In]  - Flags: Pointer to structure (Type, DataPtr, Size, Options).
 * @param a5 [In]  - Mode: Validation strictness (0 = standard, 1 = legacy).
 * @param a6 [Out] - Dest: Buffer for validated license metadata (PID4 structure).
 * @return HRESULT - 0 (S_OK) on success; PidGenX error code on failure.
 */
__int64 __fastcall sub_180009A24(__int64 a1, const wchar_t *a2, __int64 a3, __int64 a4, int a5, __int64 a6)
{
	// ....
	v11 = a2;
	v33 = a3;
	v31 = 0i64;
	v9 = 0i64;
	v8 = 0;
	
	/**
	 * @param a1 [In]  - Context: Session/State handle (v51 + 0x10).
	 * @param v11[In]  - KeyStr: Original 25-character Product Key string.
